product/load-test/results/scenario1-lock/before/run5/warmup.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ann/Programming/Java Projects/hub-eleven/product/load-test/scripts/scenario1-stock-decrease-lock.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 50s max duration (incl. graceful stop):
              * warmup: 10 looping VUs for 30s (gracefulStop: 20s)

time="2026-08-05T13:34:20+09:00" level=info msg="초기 재고: 100000000" source=console

running (01.0s), 10/10 VUs, 39 complete and 0 interrupted iterations
warmup   [   3% ] 10 VUs  00.8s/30s

running (02.0s), 10/10 VUs, 115 complete and 0 interrupted iterations
warmup   [   6% ] 10 VUs  01.8s/30s

running (03.0s), 10/10 VUs, 233 complete and 0 interrupted iterations
warmup   [   9% ] 10 VUs  02.8s/30s

running (04.0s), 10/10 VUs, 422 complete and 0 interrupted iterations
warmup   [  13% ] 10 VUs  03.8s/30s

running (05.0s), 10/10 VUs, 606 complete and 0 interrupted iterations
warmup   [  16% ] 10 VUs  04.8s/30s

running (06.0s), 10/10 VUs, 802 complete and 0 interrupted iterations
warmup   [  19% ] 10 VUs  05.8s/30s

running (07.0s), 10/10 VUs, 1017 complete and 0 interrupted iterations
warmup   [  23% ] 10 VUs  06.8s/30s

running (08.0s), 10/10 VUs, 1254 complete and 0 interrupted iterations
warmup   [  26% ] 10 VUs  07.8s/30s

running (09.0s), 10/10 VUs, 1501 complete and 0 interrupted iterations
warmup   [  29% ] 10 VUs  08.8s/30s

running (10.0s), 10/10 VUs, 1738 complete and 0 interrupted iterations
warmup   [  33% ] 10 VUs  09.8s/30s

running (11.0s), 10/10 VUs, 1982 complete and 0 interrupted iterations
warmup   [  36% ] 10 VUs  10.8s/30s

running (12.0s), 10/10 VUs, 2225 complete and 0 interrupted iterations
warmup   [  39% ] 10 VUs  11.8s/30s

running (13.0s), 10/10 VUs, 2479 complete and 0 interrupted iterations
warmup   [  43% ] 10 VUs  12.8s/30s

running (14.0s), 10/10 VUs, 2735 complete and 0 interrupted iterations
warmup   [  46% ] 10 VUs  13.8s/30s

running (15.0s), 10/10 VUs, 2987 complete and 0 interrupted iterations
warmup   [  49% ] 10 VUs  14.8s/30s

running (16.0s), 10/10 VUs, 3235 complete and 0 interrupted iterations
warmup   [  53% ] 10 VUs  15.8s/30s

running (17.0s), 10/10 VUs, 3447 complete and 0 interrupted iterations
warmup   [  56% ] 10 VUs  16.8s/30s

running (18.0s), 10/10 VUs, 3645 complete and 0 interrupted iterations
warmup   [  59% ] 10 VUs  17.8s/30s

running (19.0s), 10/10 VUs, 3893 complete and 0 interrupted iterations
warmup   [  63% ] 10 VUs  18.8s/30s

running (20.0s), 10/10 VUs, 4070 complete and 0 interrupted iterations
warmup   [  66% ] 10 VUs  19.8s/30s

running (21.0s), 10/10 VUs, 4296 complete and 0 interrupted iterations
warmup   [  69% ] 10 VUs  20.8s/30s

running (22.0s), 10/10 VUs, 4546 complete and 0 interrupted iterations
warmup   [  73% ] 10 VUs  21.8s/30s

running (23.0s), 10/10 VUs, 4784 complete and 0 interrupted iterations
warmup   [  76% ] 10 VUs  22.8s/30s

running (24.0s), 10/10 VUs, 5022 complete and 0 interrupted iterations
warmup   [  79% ] 10 VUs  23.8s/30s

running (25.0s), 10/10 VUs, 5260 complete and 0 interrupted iterations
warmup   [  83% ] 10 VUs  24.8s/30s

running (26.0s), 10/10 VUs, 5492 complete and 0 interrupted iterations
warmup   [  86% ] 10 VUs  25.8s/30s

running (27.0s), 10/10 VUs, 5734 complete and 0 interrupted iterations
warmup   [  89% ] 10 VUs  26.8s/30s

running (28.0s), 10/10 VUs, 5981 complete and 0 interrupted iterations
warmup   [  93% ] 10 VUs  27.8s/30s

running (29.0s), 10/10 VUs, 6206 complete and 0 interrupted iterations
warmup   [  96% ] 10 VUs  28.8s/30s

running (30.0s), 10/10 VUs, 6431 complete and 0 interrupted iterations
warmup   [  99% ] 10 VUs  29.8s/30s
time="2026-08-05T13:34:50+09:00" level=info msg="초기 재고: 100000000" source=console
time="2026-08-05T13:34:50+09:00" level=info msg="최종 재고: 99993517" source=console
time="2026-08-05T13:34:50+09:00" level=info msg="차감된 수량: 6483" source=console
time="2026-08-05T13:34:50+09:00" level=info msg="차감된 수량이 summary의 stock_decrease_successes count와 일치하는지 확인하세요" source=console


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate==0' rate=0.00%

    stock_unexpected_failures
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 6483    214.194044/s
    checks_succeeded...: 100.00% 6483 out of 6483
    checks_failed......: 0.00%   0 out of 6483

    ✓ 차감 성공 또는 락 타임아웃

    CUSTOM
    stock_decrease_successes........: 6483   214.194044/s
    stock_lock_timeout_rate.........: 0.00%  0 out of 6483
    stock_unexpected_failure_rate...: 0.00%  0 out of 6483
    stock_unexpected_failures.......: 0      0/s

    HTTP
    http_req_duration...............: avg=46.17ms min=4.6ms  med=40.54ms max=423.89ms p(90)=53.65ms p(95)=74.2ms  p(99)=143.43ms
      { expected_response:true }....: avg=46.17ms min=4.6ms  med=40.54ms max=423.89ms p(90)=53.65ms p(95)=74.2ms  p(99)=143.43ms
    http_req_failed.................: 0.00%  0 out of 6485
    http_reqs.......................: 6485   214.260123/s

    EXECUTION
    iteration_duration..............: avg=46.29ms min=18.9ms med=40.66ms max=426.06ms p(90)=53.78ms p(95)=74.29ms p(99)=142.64ms
    iterations......................: 6483   214.194044/s
    vus.............................: 10     min=10        max=10
    vus_max.........................: 10     min=10        max=10

    NETWORK
    data_received...................: 3.9 MB 127 kB/s
    data_sent.......................: 1.3 MB 42 kB/s



running (30.3s), 00/10 VUs, 6483 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 10 VUs  30s